; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph3 - mode
	image1 - mode
	infrared0 - mode
	thermograph2 - mode
	Star2 - direction
	Star1 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Phenomenon22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument2 spectrograph3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument5 thermograph2)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star15)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 Star3)
	(supports instrument7 image1)
	(supports instrument7 spectrograph3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star3)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star3)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite4 Planet6)
	(have_image Star5 spectrograph3)
	(have_image Planet6 infrared0)
	(have_image Star7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon13 infrared0)
	(have_image Planet14 image1)
	(have_image Star15 thermograph2)
	(have_image Phenomenon16 spectrograph3)
	(have_image Phenomenon17 spectrograph3)
	(have_image Phenomenon19 thermograph2)
	(have_image Planet20 infrared0)
	(have_image Phenomenon21 infrared0)
	(have_image Phenomenon22 image1)
	(have_image Phenomenon23 thermograph2)
	(have_image Phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 20
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 20
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 20
4. (turn_to satellite4 planet6 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet6)
   goals met: 1 of 20
5. (turn_to satellite1 star1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star1)
   goals met: 1 of 20
6. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 1 of 20
7. (turn_to satellite1 phenomenon13 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 20
8. (take_image satellite1 phenomenon13 instrument3 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 20
9. (turn_to satellite1 phenomenon19 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon19)
   goals met: 2 of 20
10. (take_image satellite1 phenomenon19 instrument3 thermograph2)
   added: (have_image phenomenon19 thermograph2)
   goals met: 3 of 20
11. (turn_to satellite1 phenomenon21 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 phenomenon21)
   goals met: 3 of 20
12. (take_image satellite1 phenomenon21 instrument3 infrared0)
   added: (have_image phenomenon21 infrared0)
   goals met: 4 of 20
13. (turn_to satellite1 phenomenon23 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon23)
   goals met: 4 of 20
14. (take_image satellite1 phenomenon23 instrument3 thermograph2)
   added: (have_image phenomenon23 thermograph2)
   goals met: 5 of 20
15. (turn_to satellite1 phenomenon24 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 phenomenon24)
   goals met: 5 of 20
16. (take_image satellite1 phenomenon24 instrument3 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 6 of 20
17. (turn_to satellite1 planet12 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 planet12)
   goals met: 6 of 20
18. (take_image satellite1 planet12 instrument3 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 7 of 20
19. (turn_to satellite1 planet20 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet20)
   goals met: 7 of 20
20. (take_image satellite1 planet20 instrument3 infrared0)
   added: (have_image planet20 infrared0)
   goals met: 8 of 20
21. (turn_to satellite1 planet6 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet6)
   goals met: 8 of 20
22. (take_image satellite1 planet6 instrument3 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 9 of 20
23. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 9 of 20
24. (take_image satellite1 planet8 instrument3 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 10 of 20
25. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 10 of 20
26. (take_image satellite1 planet9 instrument3 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 11 of 20
27. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 11 of 20
28. (take_image satellite1 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 12 of 20
29. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 12 of 20
30. (take_image satellite1 star11 instrument3 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 13 of 20
31. (turn_to satellite1 star15 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star15)
   goals met: 13 of 20
32. (take_image satellite1 star15 instrument3 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 14 of 20
33. (turn_to satellite1 star7 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star7)
   goals met: 14 of 20
34. (take_image satellite1 star7 instrument3 infrared0)
   added: (have_image star7 infrared0)
   goals met: 15 of 20
35. (turn_to satellite0 phenomenon16 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon16)
   goals met: 15 of 20
36. (turn_to satellite0 star4 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star4)
   goals met: 15 of 20
37. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 15 of 20
38. (turn_to satellite0 phenomenon16 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon16)
   goals met: 15 of 20
39. (take_image satellite0 phenomenon16 instrument0 spectrograph3)
   added: (have_image phenomenon16 spectrograph3)
   goals met: 16 of 20
40. (turn_to satellite0 phenomenon17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon17)
   goals met: 16 of 20
41. (take_image satellite0 phenomenon17 instrument0 spectrograph3)
   added: (have_image phenomenon17 spectrograph3)
   goals met: 17 of 20
42. (turn_to satellite0 phenomenon22 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon22)
   goals met: 17 of 20
43. (take_image satellite0 phenomenon22 instrument0 image1)
   added: (have_image phenomenon22 image1)
   goals met: 18 of 20
44. (turn_to satellite0 planet14 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 planet14)
   goals met: 18 of 20
45. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 19 of 20
46. (turn_to satellite0 star5 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star5)
   goals met: 19 of 20
47. (take_image satellite0 star5 instrument0 spectrograph3)
   added: (have_image star5 spectrograph3)
   goals met: 20 of 20
